docs/mathematics/linear_algebra/KBrefOrthogonalComplement.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-11 Sat 18:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Orthogonal Complement</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Taproot" />
<link rel="stylesheet" href="https://taproot3.sanity.gq/global.css" type="text/css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://taproot3.sanity.gq/sitemap.html"> UP </a>
 |
 <a accesskey="H" href="https://taproot3.sanity.gq/theindex.html"> HOME </a>
</div><div id="content">
<h1 class="title">Orthogonal Complement</h1>
<div id="outline-container-org7df2a8d" class="outline-2">
<h2 id="org7df2a8d"><span class="section-number-2">1</span> Axler6.45 orthogonal complement, \(U^\bot\)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="def">def</span></span></h2>
<div class="outline-text-2" id="text-1">
<blockquote>
<p>
if \(U\) is a subset of \(V\), then the orthogonal complement of \(U\), denoted \(U^\bot\), is the set of all vectors in \(V\) that are orthogonal to every vector in \(U\):
</p>

<p>
\[\begin{aligned}
  U^\bot = \{ v \in V : \langle v, u \rangle = 0 \forall u \in  U \}
  \end{aligned}\]
</p>
</blockquote>
</div>
<div id="outline-container-org468ef5e" class="outline-3">
<h3 id="org468ef5e"><span class="section-number-3">1.1</span> results</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orge23b4ea" class="outline-4">
<h4 id="orge23b4ea"><span class="section-number-4">1.1.1</span> Axler6.46 basic properties</h4>
<div class="outline-text-4" id="text-1-1-1">
</div>
<div id="outline-container-org2c3b29c" class="outline-5">
<h5 id="org2c3b29c"><span class="section-number-5">1.1.1.1</span> complement is a subspace: if \(U\) is a subset of \(V\), then \(U^\bot\) is a subspace of \(V\)</h5>
<div class="outline-text-5" id="text-1-1-1-1">
</div>
<div id="outline-container-orgde57a43" class="outline-6">
<h6 id="orgde57a43"><span class="section-number-6">1.1.1.1.1</span> zero is orthogonal to each vector, any vector that is the sum of two fully orthogonal vectors or the scalar multiple of an orthogonal vector will still be fully orthogonal.</h6>
</div>
</div>
<div id="outline-container-org7126796" class="outline-5">
<h5 id="org7126796"><span class="section-number-5">1.1.1.2</span> \(\{0\}^\bot = V\)</h5>
<div class="outline-text-5" id="text-1-1-1-2">
</div>
<div id="outline-container-org6ceab71" class="outline-6">
<h6 id="org6ceab71"><span class="section-number-6">1.1.1.2.1</span> zero orthogonal to every vector</h6>
</div>
</div>
<div id="outline-container-org9d451f7" class="outline-5">
<h5 id="org9d451f7"><span class="section-number-5">1.1.1.3</span> \(V ^\bot = \{0\}\)</h5>
<div class="outline-text-5" id="text-1-1-1-3">
</div>
<div id="outline-container-org7cdd9d5" class="outline-6">
<h6 id="org7cdd9d5"><span class="section-number-6">1.1.1.3.1</span> only zero orthogonal to every vector</h6>
</div>
</div>
<div id="outline-container-org0f91c6f" class="outline-5">
<h5 id="org0f91c6f"><span class="section-number-5">1.1.1.4</span> If \(U\) is a subset of \(V\), then \(U \cap U^\bot\subseteq \{0\}\)</h5>
<div class="outline-text-5" id="text-1-1-1-4">
</div>
<div id="outline-container-org50d1bd1" class="outline-6">
<h6 id="org50d1bd1"><span class="section-number-6">1.1.1.4.1</span> only zero is orthogonal to itself</h6>
</div>
</div>
<div id="outline-container-org667aa9b" class="outline-5">
<h5 id="org667aa9b"><span class="section-number-5">1.1.1.5</span> If \(U\) and \(W\) are subsets of \(V\) and \(U\subseteq W\) then \(W^\bot \subseteq U^\bot\)</h5>
<div class="outline-text-5" id="text-1-1-1-5">
</div>
<div id="outline-container-org3afdf1e" class="outline-6">
<h6 id="org3afdf1e"><span class="section-number-6">1.1.1.5.1</span> Everything in \(W^\bot\) is in \(U^\bot\), and more.</h6>
</div>
</div>
</div>
<div id="outline-container-orgf518b06" class="outline-4">
<h4 id="orgf518b06"><span class="section-number-4">1.1.2</span> Axler6.47 direct sum of a subspace and its orthogonal complement</h4>
<div class="outline-text-4" id="text-1-1-2">
<blockquote>
<p>
Suppose \(U\) is a finite-dimensional subspace of \(V\). Then,
\[\begin{aligned}
    V = U \oplus U^\bot
	\end{aligned}\]
</p>
</blockquote>
<p>
This can be shown by seeing that splitting any vector in \(V\) into a \(U\) part and a non-\(U\) part leads to the non-\(U\) being in \(U^\bot\)
</p>
</div>
</div>
<div id="outline-container-org4996c27" class="outline-4">
<h4 id="org4996c27"><span class="section-number-4">1.1.3</span> Axler6.50 dimension of orthogonal complement</h4>
<div class="outline-text-4" id="text-1-1-3">
<blockquote>
<p>
Suppose \(V\) is finite-dimensional and \(U\) is a subpsace of \(V\). Then,
</p>

<p>
\[\begin{aligned}
    \odim $U^\bot$ = $\odim V - \odim U$
	\end{aligned}\]
</p>
</blockquote>
<p>
By the dimension of a subspace addition (Axler3.78)
</p>
</div>
</div>

<div id="outline-container-org265358b" class="outline-4">
<h4 id="org265358b"><span class="section-number-4">1.1.4</span> Axler6.51 orthogonal complement of orthogonal complement is itself</h4>
<div class="outline-text-4" id="text-1-1-4">
<blockquote>
<p>
Suppose \(U\) is a finite-dimensional subspace of \(V\). Then
\[\begin{aligned}
    U = (U^\bot) ^\bot
	\end{aligned}\]
</p>
</blockquote>
<p>
Because \(U \oplus U^\bot = V\) is a direct sum and equals \(V\).
</p>

<p>
The actual proof is by double-inclusion.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="namedate"><p class="subtitle"><span class="author">Taproot</span><span class="date">2021-09-11 Sat 16:34</span></p></div><div class="taprootcopyright">(c) 2021 Houjun Liu, Huxley Marvit, Zachary Sayyah, Albert Huang, Dylan Wallace</div>
</div>
</body>
</html>
